Workspace/run/sod_shock_tube-waveTransimition-pu/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    leftSide
    {
        type            waveTransmissive;
        gamma           1.4;
        value           uniform (0 0 0);
    }
    rightSide
    {
        type            waveTransmissive;
        gamma           1.4;
        value           uniform (0 0 0);
    }
    emptywalls
    {
        type            empty;
    }
}


// ************************************************************************* //
